---
kind: method
id: M:Autodesk.Revit.DB.UpdaterId.Dispose
source: html/79aa07cd-51f9-4ddf-75e0-d5f346197983.htm
---
# Autodesk.Revit.DB.UpdaterId.Dispose Method

Releases all resources used by the UpdaterId

## Syntax (C#)
```csharp
public void Dispose()
```